{
    "0": {
        "company": "LoanCrate",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-software-engineer-loancrate-201297",
        "name": "Senior Software Engineer",
        "location": "🌏 Worldwide",
        "pay": "💰 $60k - $400k",
        "tags": "Engineer;Developer;JavaScript;Full Stack;React;GraphQL;Typescript;Node",
        "day": "16d",
        "description": "What is LoanCrate?"
    },
    "1": {
        "company": "Sticker Mule",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-backend-sticker-mule-183322",
        "name": "Software Engineer Backend",
        "location": "🌏 Worldwide",
        "pay": "💰 $130k - $180k",
        "tags": "Developer;JavaScript;React;Ruby;Postgres;Docker;GraphQL;Typescript;Redis",
        "day": "22d",
        "description": "About Sticker Mule\nSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a globally distributed team that enjoys building happy customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\nSee more about our teams here\nWe offer\nRemote work with flexible schedules\nA privately owned, low-stress culture.\nA fun \"no bullshit\" work environment\nWe like you to know\nDocker\nRuby\nRails\nTypeScript\nNodeJS\nGraphQL\nPostgres\nRedis\nFamiliarity with React\nExcellent communication skills (English)\nDegree in Computer Science or equivalent practical experience\nChallenges\nImprove and expand our GraphQL APIs\nMigrate a large Rails code base to NodeJS services\nMaintain optimal back-end performance\nCompensation and benefits\nSalary: $135k+ based on experience\n$20,000 signing bonus\n4 weeks vacation + holidays based on your country of residence"
    },
    "2": {
        "company": "Sticker Mule",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-sticker-mule-154359",
        "name": "Software engineer",
        "location": "🌏 Worldwide",
        "pay": "💰 $140k - $150k",
        "tags": "Developer;JavaScript;React;Ruby;Node;Postgres;Docker;GraphQL;Typescript;Redis;Next",
        "day": "21d",
        "description": "About Sticker Mule\nSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a globally distributed team that enjoys building happy customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\nSee more about our teams here\nWe offer\nRemote work with flexible schedules\nA privately owned, low-stress culture.\nA fun \"no bullshit\" work environment\nWe like you to know\nDocker\nNextJS\nTypeScript\nExcellent communication skills (English)\nDegree in Computer Science or equivalent practical experience\nChallenges\nImprove and expand our React shared components gallery\nMaintain optimal front-end performance on desktop and mobile\nCompensation and benefits\nSalary: $135k+ based on experience\n$20,000 signing bonus\n4 weeks vacation + holidays based on your country of residence\nOUTDO\nSalary and compensation\nBenefits\n🌎 Distributed team\n⏰ Async\n🏖 Paid time off\n🖥 Home office budget\n⬜️ No whiteboard interview\n👀 No monitoring system\n🎅 We hire old (and young)"
    },
    "3": {
        "company": "HockeyStack",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-frontend-engineer-hockeystack-205689",
        "name": "Senior Frontend Engineer",
        "location": "🌎 North America",
        "pay": "💰 $120k - $150k",
        "tags": "Developer;JavaScript;Front End;Design;React;CSS;HTML",
        "day": "7d",
        "description": "HockeyStack\nWe launched the final iteration of the product last year. We are now scaling our product and building out new features.\nTechnical Expectations\nm\nigrate our current frontend (Pug + JS + CSS) to React.\nBut we also expect you to:\nHave an eye for sleek and pixel-perfect design (ex. Linear, Notion, Stripe)\nHave enough Figma skills to design what you think\nThink about the UX of our platform\n...and actually execute these ideas in code\nWe want to make B2B analytics as accessible as possible but also have a cool product to show off ;) You will work directly with the founders to make HockeyStack the coolest product on the market.\nNon-technical Expectations\nExcellent communication skills (English) is a must.\nWe aren’t looking for someone with 20 years of experience, we are looking for smart people who are up for a challenge.\nYou should have experience with at least a CRM, an analytics tool, or a MarTech tool of some kind.\nyou should have some context on this industry beforehand\nThis also means that your role within the company is bound to grow and gain importance over time.\nWhy HockeyStack?\nThe company is very young for where we want to be, but although this may scare some people off, we believe that this is a tremendous opportunity to actually build something greater than all of us. We have the fastest team in our market right now and we want to keep it that way. We are already becoming a market leader in the attribution space, but we need more teammates (aka you) for our more ambitious goals.\nUPLIFTING\nSalary and compensation\nBenefits\n🌎 Distributed team\n⏰ Async\n🖥 Home office budget\n⬜️ No whiteboard interview"
    },
    "4": {
        "company": "DebugBear",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-full-stack-javascript-developer-debugbear-195916",
        "name": "Senior Full Stack JavaScript Developer",
        "location": "🇪🇺 Europe",
        "pay": "💰 $120k - $140k",
        "tags": "Developer;JavaScript;React;Node;Postgres;Typescript",
        "day": "26d",
        "description": "DebugBear\n−\nNo recruiters please\nWhat we do\nDebugBear helps companies monitor and optimize the loading speed of their websites. We run continuous performance tests, generate detailed technical reports, and send out alerts when there's a problem.\nOur users are a mix of developers, technical SEOs, and business owners.\nThe role\nYou will:\nBe responsible for most of the development work on our product.\nConsider user experience, implementation costs, and maintainability\nTake on a variety of technical tasks and complete them successfully, sometimes in the absence of established processes\nBe mindful of customer needs to understand and challenge requirements and solutions\nThe current team consists of the technical founder and one part-time developer. In this role you'll have a significant impact on the codebase and product.\nWorking at DebugBear\nWe value building a stable product that doesn't break unexpectedly, especially not outside work hours. That means working with proven technologies where possible, writing automated tests, and setting up monitoring to detect problems early.\nWhile there is some flexibility with work hours, this is not an asynchronous role. Frequent communication is expected.\nCollaboration is mostly through Slack and GitHub issues. We usually have 3 to 4 calls a week, though that's pretty flexible.\nTech stack\nHere are some of the technologies we use:\nNode, TypeScript, Express\nPostgres, ClickHouse\nReact, Webpack, Sass CSS\nJest, Puppeteer\nGoogle Cloud\nApplication process\nIntroductory call discussing the role and your experience\nTechnical interview (Live coding task)\nFinal interview (Mostly technical questions)\nReference check\nOffer"
    },
    "5": {
        "company": "Stimulus",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-stimulus-132047",
        "name": "Software engineer",
        "location": "🌏 Worldwide",
        "pay": "💰 $120k - $130k",
        "tags": "Developer;JavaScript;React;Docker",
        "day": "5d",
        "description": "About Stimulus\nStimulus\nWe offer\nRemote work with flexible schedules\nA privately owned, low-stress culture.\nA fun \"no bullshit\" work environment\nWe like you to know\nDocker\nNextJS\nReact\nNodeJS\nGraphQL\nRedis\nCompensation and benefits\nSalary: $120k+ based on experience\n$20,000 signing bonus\n4 weeks vacation + holidays based on your country of residence\nCOMPATIBLE\nSalary and compensation\nBenefits\n🌎 Distributed team\n⏰ Async\n🏖 Paid time off\n🖥 Home office budget"
    },
    "6": {
        "company": "CloudDevs",
        "href": "https://www.remoteok.com/remote-jobs/remote-fullstack-developer-senior-clouddevs-207318",
        "name": "Fullstack developer senior",
        "location": "🇪🇺 Europe",
        "pay": "💰 $80k - $120k",
        "tags": "Developer;JavaScript;Golang;React;Ruby;Python;Node;React Native",
        "day": "3d",
        "description": ""
    },
    "7": {
        "company": "QuickNode",
        "href": "https://www.remoteok.com/remote-jobs/remote-api-engineer-quicknode-196302",
        "name": "API Engineer",
        "location": "Worldwide",
        "pay": "💰 $75k - $120k*",
        "tags": "Web3;React;GraphQL;Front-End;Back-End;Software;Code;JavaScript;API;Engineer;Fullstack",
        "day": "26d",
        "description": "QuickNode is a cloud-based infrastructure company that powers the blockchain ecosystem.\nOur mission is to be the indispensable utility that empowers companies and innovators globally to build next-generation, Web3 enabled businesses & applications using blockchain technology. QuickNode is backed by some of the world's best investors including Tiger Global, Y Combinator, SoftBank, and the Seven Seven Six Fund. The QuickNode team has over 90 people maintaining high performance global data infrastructure for amazing customers serving billions of requests daily.\nWe are a global remote first company HQ'd in Miami, Florida.\nThe Role\nWe are looking for a Fullstack engineer to work primarily on APIs who can deliver value and impact to the team in a fast and nimble way. You will have the opportunity to work with a great deal of different technologies including Typescript, NodeJS, GraphQL, RPC, REST, Go, React and more.\nWhat You'll Do\nBuild new features and products for GraphQL and RPC APIs\nOptimize and build back-end services for performance and scale\nWork on SDKs that wrap APIs\nParticipate in code designs, planning meetings, and code reviews\nWrite high quality software using\nAnalyze/debug performance issues\nCreate robust software that can be depended on by other teams\nDesign & implement common patterns, services, components and frameworks\nLeverage best-practices in continuous integration and delivery to improve quality and velocity\nWhat You'll Bring\nTechnical Expertise in Typescript, NodeJS, SQL\nExperience building APIs & micro-services\nExperience building high quality documentation\nAbility to rapidly add value to company\nAbility to learn and adapt quickly in a fast pace environment\nBonus\nExperience in Go\nExperience in containerizing applications, CI/CD pipelines, k8s\nExperience in building public APIs\nExperience in React, front-end development, creating and publishing javascript packages\nWe at Quicknode are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, React, GraphQL, JavaScript, API and Engineer jobs that are similar:\n$75,000 — $120,000/year\nLocation\nWorldwide"
    },
    "8": {
        "company": "RVO Health",
        "href": "https://www.remoteok.com/remote-jobs/remote-associate-frontend-engineer-rvo-health-169738",
        "name": "Associate Frontend Engineer",
        "location": "🌏 Probably worldwide",
        "pay": "💰 $68k - $125k*",
        "tags": "Front End;React;System;Software;Code;Web;Scrum;JavaScript;Git;Medical;Health;Healthcare;Engineer;Full-Time",
        "day": "3mo",
        "description": "AT A GLANCE\nRVO Health is building a suite of integrated products that enable data-driven, digital experiences for our brands and partners. You will work with next-generation technologies that change how millions of users connect, explore, and interact with these brands. Our engineers work on a variety of things like information collection and retrieval, distributed computing, large-scale system design, networking, data storage, and machine learning.\nIn addition to building applications that can hold up to our business's scale & growth, our team of engineers works collaboratively with the business leaders to come up with innovative solutions to grow the business. We love to build high-quality software and believe that there is real value in developing software to be easily understood, maintained, and extended. We are all about teamwork, accountability, innovation, and a customer-first approach. We work hard but do so in a collaborative, fun, and flexible work environment.\nAs a member of this remote team, you will have the opportunity to work on mission-critical projects directly impacting the evolution of our business. You will be able to apply your programming skills towards building high throughput transactional services and highly performant web experiences. We always explore new technologies and engineer better solutions for demanding business needs.\nWhat You’ll Do\nDesigning, modifying, developing, writing, testing, and implementing software.\nTaking ownership and responsibility of the work at hand and shepherding code through to production.\nCollaborating with product leaders, business stakeholders, scrum masters, and other developers to deliver a quality product.\nCreate applications that are highly-performant, web accessible and meet HIPAA and/or Medicare requirements.\nWhat We’re Looking For\n1+ years of software development experience\nFamiliarity with Git & git workflows\nStrong semantic HTML5, CSS, and JavaScript fundamentals\nReactJS familiarity\nExperience working in a Test-Driven Development (TDD) and Continuous Integration/Continuous Delivery (CI/CD) environments\nExperience writing high-quality documentation\nNice to Haves\nNextJS or other React framework experience\nTailwind CSS\nPursuant to various state Fair Pay Acts, below is a summary of compensation elements for this role at the company. The following benefits are provided by RVO Health, subject to eligibility requirements.\nStarting Salary: $60,000 - $100,000\n*Note actual salary is based on geographic location, qualifications and experience\nStarting Salary: $60,000 - $100,000\n*Note actual salary is based on geographic location, qualifications and experience\nHealth Insurance Coverage (medical, dental, and vision)\nHealth Insurance Coverage (medical, dental, and vision)\nLife Insurance\nLife Insurance\nShort and Long-Term Disability Insurance\nShort and Long-Term Disability Insurance\nFlexible Spending Accounts\nFlexible Spending Accounts\nPaid Time Off\nPaid Time Off\nHoliday Pay\nHoliday Pay\n401(k) with match\n401(k) with match\nEmployee Assistance Program\nEmployee Assistance Program\nPaid Parental Bonding Benefit Program\nPaid Parental Bonding Benefit Program\nWho We Are:\nFounded in 2022, RVO Health is a new healthcare platform of digital media brands, services and technologies focused on building relationships with people throughout their health & wellness journey. We meet people where they are in their personal health journeys and connect them with both the information and the care they need. RVO Health was created by joining teams from both Red Ventures and UnitedHealth Group’s Optum Health. Together we’re focused on delivering on our vision of a stronger and healthier world.\nRVO Health is comprised of Healthline Media (Healthline, Medical News Today, Psych Central, Greatist and Bezzy), Healthgrades, FindCare and PlateJoy; Optum Perks, Optum Store and the virtual coaching platforms Real Appeal, Wellness Coaching, and QuitForLife.\nWe offer competitive salaries and a comprehensive benefits program for full-time employees, including medical, dental and vision coverage, paid time off, life insurance, disability coverage, employee assistance program, 401(k) plan and a paid parental leave program.\nRVO Health is an equal opportunity employer that does not discriminate against any employee or applicant because of race, creed, color, religion, gender, sexual orientation, gender identity/expression, national origin, disability, age, genetic information, veteran status, marital status, pregnancy or any other basis protected by law. Employment at RVO Health is based solely on a person's merit and qualifications.\nWe are committed to providing equal employment opportunities to qualified individuals with disabilities. This includes providing reasonable accommodation where appropriate. Should you require a reasonable accommodation to apply or participate in the job application or interview process, please contact accommodations@rvohealth.com.\nli-remote\nLI-KH1\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to React, Scrum, JavaScript, Git, Medical and Engineer jobs that are similar:\n$67,500 — $125,000/year\nBenefits\n💰 401(k)\n🏖 Paid time off"
    },
    "9": {
        "company": "Mirror",
        "href": "https://www.remoteok.com/remote-jobs/remote-backend-engineer-mirror-199867",
        "name": "Backend Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $123k*",
        "tags": "Web3;React;GraphQL;Redis;System;Strategy;Health;Engineer;Backend",
        "day": "19d",
        "description": "At Mirror, our mission is to use web3 technology in order to reimagine the ways people publish, read and share writing online. We are a small, passionate team with a breadth of experience that has been building in web3 for years. Together, we aspire to build products that are beautiful and intuitive, without compromising on user sovereignty or decentralization.\nThe Company\nMirror is a web3-native publishing platform that powers a new writing ecosystem. Writers on Mirror don’t just publish, they build community and fund their writing by minting their work as Writing NFTs — collectible, minted versions of posts on Mirror. Readers on Mirror don’t just consume content, they collect it and discover new writers in each other’s collections. All of this happens within a tightly integrated web3 product that is centered around an intuitive editor that allows writers to incorporate smart contract-based economic blocks.\nWe've raised close to $14 million from investors that include a16z Crypto, Union Square Ventures, and Variant.\nResponsibilities\nSupport product development by developing our backend API\nRequirements\nExperience building and maintaining a production system at scale\nComfortable with SQL databases\nExperience designing performant and well-tested GraphQL APIs\nNice to have\nDegree in computer science\nFrontend experience (React, React Native)\nWeb3 experience\nNo-SQL and Redis experience\nExperience with monitoring tools (Honeycomb, NewRelic, ElasticSearch, etc)\nSalary Range\n$140,000 - $210,000 (based on experience)\nMirror's Benefits\nHere are some of our benefits:\nMedical, dental, and vision insurance, with 80% of premiums paid by the company\n$3,000 work-from-home/remote office setup stipend\n$150/month home internet and cell phone reimbursement\nHealthcare Flexible Spending Account or Health Savings Account\nDependent Care Flexible Spending Account\nShort-term and long-term disability insurance, with premiums paid by the company\n$50,000 life insurance and accidental death and dismemberment insurance, with premiums paid by company\n401(k)\nFlexible time off policy\nThree months’ paid baby bonding leave\nRemote-first teamwork with team and community members around the world\nTeam offsites for periodic in-person collaborative strategy sessions\nPassionate, supportive team dedicated to learning and growing together in web3\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, React, GraphQL, Redis, Engineer and Backend jobs that are similar:\n$70,000 — $122,500/year\nBenefits\n💰 401(k)\n🤓 Vision insurance\nLocation\nWorldwide"
    },
    "10": {
        "company": "GIANT Protocol",
        "href": "https://www.remoteok.com/remote-jobs/remote-lead-devops-engineer-giant-protocol-194739",
        "name": "Lead DevOps Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Web3;Crypto;React;System;Security;Support;Software;Test;Code;Scrum;DevOps;Financial;Cloud;Mobile;Lead;Junior;Operational;Excel;Telecom;Reliability;Go;Golang;Health;Engineer",
        "day": "29d",
        "description": "The GIANT Protocol Foundation aims to empower the world to build a more open and inclusive internet. It created the GIANT Protocol to decentralize and democratize access to connectivity and financial services for all. It’s a new web3 telecommunications layer that coordinates, tokenizes, and financializes ownership of the entire telecom ecosystem.\nGIANT Connect is a consumer app powered by GIANT Protocol offering the most fun and rewarding way to stay connected to the Internet. Access inflight wifi on thousands of planes, mobile networks in 120 countries, and 68M free and premium wifi hotspots globally. Earn crypto rewards when you go online and when you don’t.\nOverview\nWe are looking for a seasoned Cloud Automation/DevOps engineer, to join our growing team, who specializes in setting up CI pipelines and automating public cloud deployments. In this role you will be primarily improving and/or developing efficient containerized CI/CD pipelines and scalable Infrastructure setup for our platform. Our platform consists of Rust based blockchain modules, full stack projects built with NodeJS, Golang, React etc.\nResponsibilities\nBuild CI/CD pipeline configurations to orchestrate provisioning and deployment of both large and small scale systems for blockchain infrastructure using open source containerization tools like Terraform, Docker, Kubernetes, Chef, etc.\nEnsure robustness and reliability through monitoring, visualization, testing, reviewing & documentation.\nAutomate monitoring tools to monitor system health and reliability to support high uptime requirements.\nYou think about security in all parts of your work\nWork closely with leadership, our product team, and other engineers in roadmapping, architecture, and product discussions.\nDocument process and procedures for operational support, lessons learned, diagrams, systems administration guidelines, systems set-up documentation, test plans and results.\nDocument decisions and its future impacts.\nJoin sprints and scrum calls with our cross-regional team for successful delivery of product.\nParticipate in the on-call rotation.\nGuide and mentor junior developers.\nRequirements/Skills\n5+ years of recent experience as Lead DevOps Engineer\n5+ years of experience in DevOps, SRE, Software Development or an equivalent field.\nDeep experience of AWS, Docker, Kubernetes, Helm/Kustomize, Terraform.\nComfortable with Golang development\nPassionate about security and building productivity tools\nPassionate about solving complex problems and take pride in their code and development standards.\nEffective communication skills: Regularly achieve consensus with peers, and provide clear status updates.\nAbility to work independently and in a team environment.\nBonus skills\nFamiliarity with blockchain and web3 technologies.\nFamiliarity with Radius and VPN.\nCompany Values\nThinking in possibilities: We realize that most see the world in terms of what is not possible. We believe the future is made by those who see what is possible. Seeing a path of possibilities requires intellectual curiosity, dedication, and diligence. We are big thinkers and believers but also pragmatists, focused on relentless execution.\nIntegrity of word, thought, and action: Integrity is what is behind our words, thoughts, and actions. We help ourselves and others to stay true to why we do things so we can align, together, for the highest purpose.\nDiversity of perspectives: A good discussion is one that ends with all participants feeling that the other participants understood them, even if they had different ideas. This requires trust, vulnerability, and compassion. We believe organizations where people can truly co-create will thrive.\nWinning with purpose: We are mission focused and realize that winning is a requirement to achieve lasting change that benefits everyone. Even though we love to compete, we understand that winning is not the same as success, but is needed to succeed.\nOwnership is key: When we own our successes, failures, best qualities, and flaws, we can truly work in a team, as a team. Ownership unlocks greatness as a team because it enables us to support and be supported.\nThe excellence of being: Excellence is an expression of being–of what we want for ourselves and others. It is passion turned into action. We share a desire to learn and excel while being comfortable with failing. Excellence comes when we’re courageously open about what we desire for this world.\nUnity in consciousness: We understand that we are all one. We are all working towards moving humanity forward in unique ways. We firmly believe that there is infinitely more that unites us than divides us, and our work is to bring that out in the world.\nBenefits:\nCompetitive salary with generous token plan\nUnlimited PTO and flexible remote options\nHealth benefits: medical, dental, vision, EAP, virtual medicine, and more\n401k with company match\nAnnual professional development budget\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, Crypto, React, Scrum, DevOps, Cloud, Mobile, Junior, Excel, Golang and Engineer jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n💰 401(k)\nLocation\nWorldwide"
    },
    "11": {
        "company": "Status SNT",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-status-snt-194725",
        "name": "Software Engineer",
        "location": "Remote (Worldwide)",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Web3;NFT;Ethereum;React;Support;Developer;Mobile;Lead;Golang;Engineer",
        "day": "29d",
        "description": "About Status\nStatus is building the tools and infrastructure for the advancement of a secure, private, and open web3. \nWith the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.\nAs an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community. \nAs a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol (a continuation of Whisper).\nAs a team, Status has been completely distributed since inception. Our team is currently 150+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe. \nWe care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.\nAbout Waku\nWe are building Waku as a public good infrastructure. Waku is the messaging layer of Web3.\nIt is a decentralized, censorship-resistant, privacy-preserving communication network that enables anyone to send and receive messages without worrying about surveillance or deplatforming.\nWe are developing 3 open source implementations of Waku:\nNwaku. https://github.com/status-im/nwaku: the reference implementation and service node,\nJs-waku, https://github.com/waku-org/js-waku: for the browser\nGo-waku: https://github.com/waku-org/go-waku: to integrate as a library in native applications\nWe are enabling Ethereum builders to create new projects with a fully decentralized architecture, think dApp to Wallet notifications, NFT marketplaces, censorship-resistant chat, layer-2 decentralization and more.\nWe are looking for a developer relation engineer who is passionate about Ethereum, and decentralization. And who would relish the opportunity to champion Waku to other Web3 projects and developers.\nKey Responsibilities\nDesign, implement and document Waku Golang libraries (go-waku)\nMaintain, improve, troubleshoot Waku React Native, the React Native wrapper of go-waku.\nImplement new protocols as defined by the Research Team\nInvestigate and fix issues in go-waku and upstream libraries such as go-libp2p\nOptimize go-waku and upstream libraries for the mobile/React Native\nSupport dApp developers in using go-waku and Waku Golang libraries\nYou ideally will have\nHave experience building applications with complex logic, cutting edge technology or applied research.\nHave demonstrated the ability to learn new concepts and technologies quickly, you are a polyglot.\nHave experience maintaining native library for React Native.\nHave experience building libraries in Golang, for network and mobile environments.\nHave passion for blockchain and decentralized technologies and understand how they work.\nHave good communication skills (written and conversational).\nHave a strong alignment to our principles: https://status.im/about/#our-principles\nBonus points if\nAre already familiar with the Ethereum community,\nHave experience with go-libp2p or other libp2p implementations\nHave experience with C-Bindings & Cgo\nIn Web3 or blockchain development\nWorking for an open source organization\nWorking remotely\n[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].\nHiring Process\nThe hiring process for this role will be:\nInterview with our People Ops team\nTechnical with Waku Product and js-waku lead\nTechnical & Culture Interview with a Member of the Vac & Waku Product Teams\nInterview with a Program Lead\nCompensation\nThe expected compensation range for this role is $65,000 - $80,000 (negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto).\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, React, Mobile, Golang, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nLocation\nRemote (Worldwide)"
    },
    "12": {
        "company": "Braintrust",
        "href": "https://www.remoteok.com/remote-jobs/remote-sora-schools-software-engineer-flutter-direct-hire-braintrust-195238",
        "name": "Sora Schools Software Engineer Flutter Direct Hire",
        "location": "Global",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Design;React;System;Back-End;Consulting;Technical;Writer;Support;UX;Code;Web;Quality Assurance;Flutter;Node. JS;Mobile;Management;Engineer;Backend",
        "day": "28d",
        "description": "ABOUT US:\nBraintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.\nABOUT THE HIRING PROCESS:\nWhen you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.\nJOB TYPE: Direct Hire Position (no agencies/C2C - see notes below)\nLOCATION: Remote - Work from anywhere (Time Zone: EST | Partial overlap)\nSALARY: $65,000 – $100,000/yr\nESTIMATED DURATION: 40hr/week\nESTIMATED DURATION: 40hr/week\nTHE OPPORTUNITY\nWe’re looking for candidates with strong track records of putting mobile and desktop apps to work and bringing products to life. You should be experienced in Flutter and backend with a Postgres/Node stack.\nWe're a remote company so the bulk of our work is written – from the code and interfaces we design, to the pull request discussions and requests for comments we make – being a good writer is important. Effective, concise writing leads to effective, concise code.\nWe do good work together. That comes with direct feedback, openness to each others’ experience, and willingness to show up for each other as well as for the technical work at hand. We’re in this for the long term.\nWhile you'll report to a team lead, Sora Schools is a company where self managers thrive. We're quick to trust that you can do it, and here to support you in making it so. You can expect to be counted on. You can expect to do your best work and build a career here.\nWhat you’ll be working on\nAs a Flutter Engineer at Sora Schools, you'll work to build new product features and keep our app fast, secure, and reliable. But, depending on your interests and skills, you may do more feature work or more infrastructure work but the boundaries are fluid, and people can switch work scopes.\nRight now, we're maintaining our LMS Sora Home 1.5 in web tech, and building its next mobile-first version Sora Home 2.0. Our web version is currently built as with a Node.js back-end React front-end, and going forward, we're all-in on Flutter mobile and desktop apps.\nWe use a variant of Shape Up methodology so you won't have a backlog of tickets to blindly check. Your work shall be deliberate. You'll receive entire projects to tackle end-to-end in 5 week cycles where you'll do your own discovery, both on the code and on the product, before you dive into writing your own code, Scope Hammering, testing, debugging, refactoring and shipping! But you'll not be alone. You'll have full support of QA and Sora seasoned engineers to help you along the way.\nHere are some real examples of mobile work we’ve done lately that might help you to get a better idea of what the job could entail:\nSetup a new Flutter project with CI/CD setup and local cache, state management and routing libraries\nSetting up a design system package and implementing our first components\nCreate a mobile specific endpoint in our backend with Prisma and Node\nDevelop a simple calendar component that properly handles conflicting events\nCoding a mobile Google Authentication flow\nAll of those also were carefully tested with unit tests, integration tests and ultimately manual tests to ensure the UX is actually great!\nThis is a fully remote position. You’re free to work where you work best: home office, co-working space, coffeeshops. We are primarily hiring from the Americas but as long as your workday can have at least a 4-hour overlap with an Atlanta workday (eastern time zone 9-5), it can work. We don't want anyone working a graveyard shift to make that happen, though.\nApply Now!\nC2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.\nBraintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, React, Consulting, Flutter, Mobile, Engineer, Backend and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nLocation\nGlobal"
    },
    "13": {
        "company": "Phantom",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-mobile-phantom-195776",
        "name": "Software Engineer Mobile",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Web3;Defi;Crypto;React;Swift;Technical;Support;Developer;Financial;C;Mobile;Engineer;Engineering;Full-Time",
        "day": "27d",
        "description": "Our crypto wallet is used by millions of people to access apps and financial services built on the Solana blockchain. As a mobile engineer at Phantom you’ll be doing everything from creating delightful user experiences, contributing to cross-platform client infrastructure, and crafting web3 developer SDKs. Join us on our mission to make the digital economy safe and easy to use for everyone.\nThis role is fully remote; however, we’re only open to candidates based in US and EU time zones\nReact Native / Swift / Objective C / Kotlin\nSolana web3.js / ethers.js\nResponsibilities\nPush forward our mobile efforts: You’ll be directly impacting the development of our flagship mobile app in React Native, working closely with the founders to constantly improve the product\nNew initiatives and products: You will be leading initiatives to add support for other blockchains to Phantom, and to launch new complementary products or infrastructure.\nInterfacing with users: You will be interfacing directly with end-users and developers building on Phantom. Supporting them and collecting feedback to inform the direction of the product.\nTeam building: You will be working with the team to create and foster a culture of raising the bar with each new hire.\nQualifications\nBachelors degree in Computer Science or related technical field or equivalent practical experience\n5+ years full-time software engineering experience\n1+ years full-time experience with React Native\nDemonstrated interest in open and community-driven platforms\nNice-To-Have: experience in a blockchain based project\nOpportunity\nWe are a team of experienced builders with a ton of traction in a big and growing market – our users are so passionate they were hacking their way into our private beta. Only months after launching we've acquired millions of users, and are adding hundreds of thousands every week. We are by far the leading wallet on Solana, and plan to expand to other chains soon.\nOn top of that, there has never been a better time to work in crypto and on wallets in particular.\nWallets play a pivotal role: Wallets are responsible for on-boarding new users into crypto, and can make or break the user experience.\nWe are moving to a multi-chain world: New blockchains and scaling solutions are coming online and gaining traction, but are lacking decent wallets and bridges.\nDeFi & NFTs are exploding : Interest in DeFi and NFTs has exploded, yet they are still an after-thought in existing wallets.\nBenefits\nCompetitive salary and equity.\nComprehensive insurance (medical/dental/vision) — 100% covered.\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need.\nFlexible hours and a long-standing, supportive remote environment.\nMonthly co-working space and mobile phone expense.\nUnlimited vacation: Take time when you need it (and we really mean it).\n401(k) retirement plan (although we are not matching at this time)\nWellness benefit\nDaily lunch benefit\nThe target base salary for this role will range between $150,000 to $250,000 with the addition of equity and benefits. This is determined by a few factors including your skillset, prior relevant experience, quality of interviews and market factors (such as location) at the point in time of offer.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, Defi, Crypto, React, Swift, C, Mobile, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\n💰 401(k)\n🏖 Unlimited vacation\nLocation\nWorldwide"
    },
    "14": {
        "company": "WalletConnect",
        "href": "https://www.remoteok.com/remote-jobs/remote-js-frontend-engineer-walletconnect-196809",
        "name": "JS Frontend Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Front End;Design;Web3;Crypto;React;Software;UI;Web;JavaScript;Typescript;Engineer",
        "day": "25d",
        "description": "Description\nWalletConnect is the web3 communications protocol. Since our founding in 2018, we have empowered an increasing volume of connections between wallets and apps, linking the web3 ecosystem together and fueling brand-new user experiences. We began with a single API, and are now building a suite of web3 APIs including Chat, Push, Auth, and more. In 2022, we raised our $>20M Series A/ecosystem round from USV, 1kx, Coinbase, Shopify, and other investors and customers.\nTo learn more about our plans to create a multi-API messaging network for web3, take a look at our presentation at EthCC.\nThe Role:\nWe’re looking for a frontend aficionado with passion for the smallest details to help build delightful web experiences for millions of users. This includes framework neutral tools such as web3modal.com which are served by other developers to end users as well as WalletConnect products such as our chat application that are directly served to end-users. In order to delight developers you will get to develop some framework neutral tools that can be consumed by React/Vue/VanillaJS/etc apps.\nResponsibilities:\nWork closely with our design team in the conceptualization/ideation of new products/features\nThink deeply through and deliver a compelling end-user UX\nDeliver software in TypeScript using web components/React/NextJS\nTranslate designs from Figma into reusable and optimized ui components (react / vanilla)\nMust have:\n3+ years of experience as frontend developer\nStrong portfolio of delightful web applications\nSolid written/async and verbal communication skills\nNice to have:\nDomain experience in crypto is a plus\nExperience in building framework agnostic tools is a plus\nExperience in React Native is a plus\nOpen source contributions are a plus\nBenefits\nFully remote position with flexible timezone (CET/EST preferred)\nCompetitive salary\nCompany equity\nRemote work allowance\nToken offering\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Web3, Crypto, React, Typescript, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\n⏰ Async\nLocation\nWorldwide"
    },
    "15": {
        "company": "Braintrust",
        "href": "https://www.remoteok.com/remote-jobs/remote-dtn-senior-software-engineer-direct-hire-braintrust-196801",
        "name": "DTN Senior Software Engineer Direct Hire",
        "location": "Global",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;React;Embedded;Consulting;Support;Developer;UI;Web;Financial;C++;Math;Leader;Senior;Analytics;Engineer",
        "day": "25d",
        "description": "ABOUT US:\nBraintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.\nABOUT THE HIRING PROCESS:\nWhen you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.\nJOB TYPE: Direct Hire Position (no agencies/C2C - see notes below)\nLOCATION: Remote - United States only (Time Zone: CST | Full day overlap)\nSALARY: $140,000 – $160,000/yr\nESTIMATED DURATION: 40hr/week - Long term\nTHE OPPORTUNITY\nRequirements\nDTN is looking for a Senior Software Developer to enhance and maintain an existing Windows application that provides real-time information used by financial traders around the world using a variety of technologies.\nEssential Functions:\nUse Visual C++, Visual Studio, ATL, STL, XML, Templates, Web Services.\nWork effectively both independently and as part of a team.\nAnalyze and convert general requirements into solutions that best suit the needs of a wide range of users.\nPartner with the Quality Assurance team. Develop new functionality with a strong emphasis on performance, user experience, maintainability, and reusability.\nEnhance the products charting and analytical capabilities.\nProvide application maintenance and support as required.\nRequirements:\nStrong Windows (Win32) development experience using C++ and templates.\nGood comfort level with Git.\nStrong COM experience\n3+ years of UI experience\nVisual Studio, C++, ATL, STL, XML, Web Services.\nSolid Windows graphics.\nStrong math skills.\nNice to Have:\nTypeScript / React / Node.\nWorking with embedded Edge, which is based on Chromium (Chrome).\nModern C++.\nSome C#.\nKnowledge of financial markets.\nExperience refactoring.\nWhat you’ll be working on\nDTN is a global leader providing insights and analytics to our customers to feed, fuel, and protect the world. We help people make critical business decisions that impact the agriculture, oil and gas, trading, and weather industries.\nIt’s a difference you’ve likely felt without even knowing it. From the food on your plate to the gas in your car to the last flight you took, chances are a DTN customer made it possible. And that’s just for starters. That’s why we say, “When our customers prosper, we all win.”\nComplete benefits package including health, PTO, maternity/paternity leave, and more\n6% match on 401K\nPossibility of a 10% annual bonus\nApply Now!\nBraintrust Job ID: 5902\nC2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.\nBraintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to React, Embedded, Consulting, Senior, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n💰 401(k)\nLocation\nGlobal"
    },
    "16": {
        "company": "Cake DeFi",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-cake-defi-197310",
        "name": "Software Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Crypto;Defi;Blockchain;Web3;Software;Design;React;Technical;Test;UI;JavaScript;Finance;Fintech;Typescript;Mobile;Engineer;Backend",
        "day": "24d",
        "description": "Founded in 2019, Cake DeFi is a leading decentralised finance services provider and Southeast Asia’s fastest growing fintech platform. \"We Do Crypto. You Do You.\" - Our vision is to become a one-stop platform for all crypto users to get easy access to DeFi and Web3 services. To date, more than 1 million users from over 190 countries trust us to manage over $1 billion in assets. We are a profitable, cashflow positive private rocket ship that's just getting ready for take-off. Join us.\nBirthday Research\nBirthday Research (BR) is our Blockchain Research and Development arm. Fuelled by the best minds in the industry, BR seeks to develop best-in-class blockchain innovations with the mission of enabling the next bound of Web3.\nAs a pioneering force, our work spans cryptographic research, deep blockchain consensus development, and smart contracts development — with a laser-sharp focus on driving the industry frontier while tackling the most demanding DeFi challenges of today. To date, one of our core contributions, DeFiChain, has garnered over 1 billion USD in total value locked on the layer-1 protocol.\nWe are a fast-growing, globally distributed, close-knit team of multi-disciplinary doers and getters. Join Birthday Research today to be a part of the driving force shaping the future of decentralization.\nWhat you’ll do:\nCollaborate with cross-functional teams, product designers, and managers to design and develop TypeScript based applications using React, React Native, Next.js and/or Node.js.\nWrite highly performant codes that are clean, simple, maintainable, and battle-tested with test-driven development (TDD) for maximum test coverage automated from pull request all the way to release.\nTake on active responsibility in creating highly scalable UI Components and/or backend modules for our scaling needs.\nWhat you’ll need:\nExperience working in a fast pace tech-driven startup as a Software Engineer with at least 2 years of experience or in a similar capacity.\nStrong proficiency in TypeScript or JavaScript with experience working in Web, Node, or Mobile technologies.\nAbility to take full ownership and work independently while collaborating with others in a fast-paced agile and async team.\nA collaborative and resourceful individual with excellent communication skills able to make radical decisions while being empathetic and respectful.\nWillingness to pick up new and emerging bleeding edge blockchain technologies.\nDeep technical understanding of blockchain technologies, cryptography, BIPs, DeFi, UTXO, EVM, or Nakamoto Consensus is highly preferred.\nExperience participating or maintaining in open source software development is highly preferred.\nWe want to transform and decentralise finance with tomorrow’s technology. This is where you come in. Join a company that is at the forefront of bleeding-edge innovations in blockchain and DeFi. You will be empowered to push boundaries and think out of the box. You will get to work with a bunch of ridiculously motivated and talented people. And most importantly, you'll have fun. The best places to work at, are often also the most fun to work at. That's us.\nWe hire based on merit, fit, and strong alignment to our culture. Our culture is defined by 7 team principles: Integrity, Resourcefulness, Ownership, Meritocratic Decision-making, Customer Obsession, Radical Candour, and Passion. These 7 principles guide our company, our people, and our work. At Cake DeFi, our culture is our pride. It has been instrumental to our success, so we are steadfast in our commitment to it. We welcome you to add to it.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Crypto, Defi, Blockchain, Web3, Design, React, JavaScript, Finance, Typescript, Mobile, Engineer, Backend and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n⏰ Async\nLocation\nWorldwide"
    },
    "17": {
        "company": "Binance",
        "href": "https://www.remoteok.com/remote-jobs/remote-golang-developer-wallet-platform-binance-197818",
        "name": "Golang Developer Wallet Platform",
        "location": "🇸🇬 Singapore",
        "pay": "💰 $70k - $120k*",
        "tags": "Developer;Design;Crypto;Cryptocurrency;React;Back-End;Security;Full-Stack;Technical;Software;Code;Financial;Finance;Mobile;Golang;Engineering;Backend",
        "day": "23d",
        "description": "Binance is the global blockchain company behind the world’s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money.\nAre you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?\nBinance platform provides a large range of different cryptocurrency services to retail users, high net vault individuals, institutions, and enterprise customers. As a platform backend developer, you must be active in designing and building resilient and robust server-side applications. You should be self-motivated, and be able to proactively push from the start to finish of each feature.\nResponsibilities:\nJoin the full life cycle of building crypto wallet platform products including requirement gathering, technical design, coding, testing, deployment, documentation, and support\nPartner with the product manager, DevOps, QA, and teammates to get things done\nPromote technology best practice within the team, and conduct code review for peers\nRequirements:\nAt least 2 years of back-end software development with Golang programming language\nAt least 2 years and more experience in blockchain industry is required\nHas a Bachelor’s/Master’s degree in computer science, engineering\nHas a Bachelor’s/Master’s degree in computer science, engineering\nFamiliar with software frameworks and design patterns\nFamiliar with message broker, relational database, micro-service\nChinese language is needed due to job nature\nBonus Qualifications:\nHave experience with building security systems in the financial industry\nHave experience with building cryptocurrency products, especially crypto wallets\nHave full-stack engineering experience, familiar with React or React Native or Native mobile development\nLI-Remote\nWorking at Binance\n• Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry\n• Fast moving, challenging and unique business problems\n• International work environment and flat organisation\n• Great career development opportunities in a growing company\n• Possibility for relocation and international transfers mid-career\n• Competitive salary\n• Flexible working hours, Casual work attire\nBy submitting a job application, you confirm that you have read and agree to our Candidate Privacy Notice.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Crypto, React, Finance, Mobile, Golang, Backend and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nLocation\nRemote - Singapore"
    },
    "18": {
        "company": "Stellar",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-software-engineer-stellar-198328",
        "name": "Senior Software Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Design;React;System;Full-Stack;Technical;Support;Testing;Growth;Code;Web;Voice;Financial;Java;Typescript;Mobile;Management;Senior;Engineer;Engineering;Backend",
        "day": "22d",
        "description": "Interested in working on cutting-edge blockchain technology and creating equitable access to the global financial system? Since 2014, the mission-driven team at the Stellar Development Foundation (SDF) has helped fuel the tremendous growth of the Stellar blockchain network, an open-source platform that operates at high-scale today. Developers and companies around the world build on it, and the SDF team is expanding to support the rapidly growing and changing Stellar ecosystem.\nAs a Senior Software Engineer on the Wallets team, your goal will be to architect, design and build SDKs that empower developers in the Stellar ecosystem to build their own highly customizable wallets. As the blockchain landscape continues to change and evolve, we want to ensure people can jump into our ecosystem as easily as possible. To do this, you will help build flagship SDKs along with a small team of engineers innovating and building other types of wallets for developers in our ecosystem. \nYour work on the flagship SDKs will provide users of the Stellar network fully featured SDKs that enable all of the network’s capabilities to be customized by the ecosystem. On top of providing end users the ability to easily interact with the Stellar network, you will also be collaborating with the rest of the team on creating optimal user experiences for Stellar network features. The flagship SDKs are a greenfield project and your opportunity to make a big impact and provide the ecosystem with the tools so they can fully customize and build wallets on the Stellar Network. \nStellar is an open network and we encourage developers from all over the world and all skill levels to build with us.\nIn this role, you will:\nWork on cutting edge technology at the intersection of blockchain and finance\nDesign solutions with developers and ecosystem partners in mind\nCollaborate with Product leaders to create best in class implementations of first of their kind Stellar SDKs\nWork with the product management team to develop features and iterate over time with feedback from users\nWrite code using current standards like Typescript, Kotlin, React, and Jest in an open source environment\nBuild with modern tools, we'd look to you and your expertise to make those decisions\nCollaborate with team members on code review and design, and contribute to best practices for all of engineering at SDF\nArchitect code with an eye for readability as well as scalability\nYou have:\n5+ years creating Mobile Apps and/or full-stack and web applications\nProficiency with Typescript & Kotlin\nKnowledge of backend systems\nFamiliarity with databases and data storage\nKnowledge of modern testing libraries\nIndependent and results driven. Skilled at working in an environment with dynamic objectives.\nThe ability to be a fast learner and a strong problem solver\nBonus Points if you have:\nReact and React Native Experience\nSwift or Java (for Mobile app development)\nExperience deploying web applications using Kubernetes and Docker\nExperience as a tech lead\nWe offer competitive pay with a base salary range for this position of $145,000- $190,000 depending on job-related knowledge, skills, experience, and location. In addition, we offer lumen-denominated grants along with the following perks and benefits:\nUSA Benefits/Perks:\nCompetitive health, dental & vision coverage\nFlexible time off + 15 company holidays including a company-wide holiday break\nPaid parental leave\nLife & ADD\nShort & Long term disability\nFSA & Dependent Care Accounts\n401K (4% match)\nEmployee Assistance Program\nMonthly gym allowance\nDaily lunch and snacks in-office\nL&D budget of $1,500/year\nCompany retreats\nAbout Stellar\nStellar is a decentralized, fast, scalable, and uniquely sustainable network for financial products and services. It is both a cross-currency transaction system and a platform for digital asset issuance, designed to connect the world’s financial infrastructure. Dozens of financial institutions worldwide issue assets and settle payments on the Stellar network, which has grown to over 7 million accounts.   \n \nAbout the Stellar Development Foundation\nThe Stellar Development Foundation (SDF) is a non-profit organization that supports the development and growth of Stellar, an open-source network that connects the world’s financial infrastructure. Founded in 2014, the Foundation helps maintain Stellar’s codebase, supports the technical and business communities building on the network, and serves as a voice to regulators and institutions. The Foundation seeks to create equitable access to the global financial system, using the Stellar network to unlock the world’s economic potential through blockchain technology.\n \nWe look forward to hearing from you!\n \nPrivacy Policy\nBy submitting your application, you are agreeing to our use and processing of your data in accordance with our Privacy Policy.\n \nSDF is committed to diversity in its workforce and is proud to be an equal opportunity employer. SDF does not make hiring or employment decisions on the basis of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, pregnancy, sex, gender expression or identity, sexual orientation, citizenship, or any other basis protected by applicable local, state or federal law.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, React, Testing, Java, Typescript, Mobile, Senior, Engineer, Backend and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n💰 401(k)\n🏔 Company retreats\nLocation\nWorldwide"
    },
    "19": {
        "company": "Braintrust",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-software-engineer-braintrust-198343",
        "name": "Senior Software Engineer",
        "location": "Global",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Design;SaaS;React;Front-End;Front End;Consulting;Technical;Testing;Code;DevOps;JavaScript;Serverless;Cloud;Mongo;Lead;Senior;Junior;Marketing;Engineer;Backend",
        "day": "22d",
        "description": "ABOUT US:\nBraintrust is a user-owned talent network that connects you with great jobs with no fees or membership costs—so you keep 100% of what you earn.\nABOUT THE HIRING PROCESS:\nWhen you join Braintrust, you will be invited to a screening process for Braintrust to learn more about your previous work experiences. Once completed, you will have access to the employer for this role and other top companies that seek high-quality talent. Apply to this job to kick off the process.\nJOB TYPE: Freelance, Contract Position (no agencies/C2C - see notes below)\nLOCATION: Remote - Work from anywhere (TimeZone: CST | Partial overlap)\nHOURLY RANGE: Our client is looking to pay $75 – $100/hr\nESTIMATED DURATION: 40h/week - Long-term\nESTIMATED DURATION: 40h/week - Long-term\nTHE OPPORTUNITY\nResponsibilities\nShip clean, well-tested, and highly observable code to production on a regular basis\nParticipate in planning to iterate and continuously improve the product, helping to make strategic and technical decisions as our client scales their platform\nPerform code reviews and mentor junior engineers\nCollaborate on design specifications and communicate trade-offs of different approaches\nTroubleshoot production issues\nWrite clear technical documentation\nQualifications\nExpert understanding of JavaScript and Node.js\n5+ years experience with JavaScript and Node.js\n2+ years of experience with TypeScript\nAbility to write front-end code as needed\nUnderstanding of serverless / microservice / cloud infrastructure and data pipelines\nStrong experience writing unit tests\nExperience publishing npm modules\nExperience with git, pull requests, and automated testing\nExperience working on a small team, where clear, efficient, and respectful communication is critical\nBonus Points For…\nVue.js or React experience\nFamiliarity with Ruby\nExperience with using MongoDB and AWS\nExperience working and integrating with third-party APIs\nExperience working in a DevOps environment using automated builds, testing and deployment\nCompany Overview\nOur client is the SaaS platform for consent-based marketing.\nTheir comprehensive product suite empowers companies across industries to take real-time action on their leads, protect themselves from litigation by documenting proof of consent, and save money by providing new levels of data insights and control.\nTheir mission is to make consent-based marketing the best channel for customer acquisition.\nJob Summary\nThey’re looking for a senior level full stack engineer to work on their Accounts team. You’ll help lead the architecture and implementation of new segments of their product suite, both from a frontend and backend point of view. You’ll work with Node.js, Vue.js, and serverless technology to ensure their billing and account platform is top-notch. You’ll really be key in helping to build the newest pieces of their platform.\nApply Now!\nBraintrust Job ID: 4668\nC2C Candidates: This role is not available to C2C candidates working with an agency. If you are a professional contractor who has created an LLC/corp around their consulting practice, this is well aligned with Braintrust and we’d welcome your application.\nBraintrust values the multitude of talents and perspectives that a diverse workforce brings. All qualified applicants will receive consideration for employment without regard to race, national origin, religion, age, color, sex, sexual orientation, gender identity, disability, or protected veteran status.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, SaaS, React, Consulting, Testing, DevOps, JavaScript, Serverless, Cloud, Senior, Junior, Marketing, Engineer, Backend and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nLocation\nGlobal"
    },
    "20": {
        "company": "Status SNT",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-status-snt-198336",
        "name": "Software Engineer",
        "location": "Remote (Worldwide)",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Web3;NFT;Ethereum;React;Support;Developer;Mobile;Golang;Engineer",
        "day": "22d",
        "description": "About Status\nStatus is building the tools and infrastructure for the advancement of a secure, private, and open web3. \nWith the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.\nAs an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community. \nAs a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol (a continuation of Whisper).\nAs a team, Status has been completely distributed since inception. Our team is currently 150+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe. \nWe care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.\nAbout Waku\nWe are building Waku as a public good infrastructure. Waku is the messaging layer of Web3.\nIt is a decentralized, censorship-resistant, privacy-preserving communication network that enables anyone to send and receive messages without worrying about surveillance or deplatforming.\nWe are developing 3 open source implementations of Waku:\nNwaku. https://github.com/waku-org/nwaku: the reference implementation and service node\nJs-waku, https://github.com/waku-org/js-waku: for the browser\nGo-waku: https://github.com/waku-org/go-waku: to integrate as a library in native applications\nWe are enabling Ethereum builders to create new projects with a fully decentralized architecture, think dApp to Wallet notifications, NFT marketplaces, censorship-resistant chat, layer-2 decentralization and more.\nWe are looking for a Software Engineer who is passionate about Ethereum, and decentralization. And who would relish the opportunity to champion Waku to other Web3 projects and developers.\nKey Responsibilities\nDesign, implement and document Waku Golang libraries (go-waku)\nMaintain, improve, troubleshoot Waku React Native, the React Native wrapper of go-waku\nImplement new protocols as defined by the Research Team\nInvestigate and fix issues in go-waku and upstream libraries such as go-libp2p\nOptimize go-waku and upstream libraries for the mobile/React Native\nSupport dApp developers in using go-waku and Waku Golang libraries\nYou ideally will have\nExperience building applications with complex logic, cutting edge technology or applied research\nAbility to learn new concepts and technologies quickly, you are a polyglot\nExperience maintaining native library for React Native\nExperience building libraries in Golang, for network and mobile environments\nGood communication skills (written and conversational)\nStrong alignment to our principles: https://status.im/about/#our-principles\nBonus points if\nYou are already familiar with the Ethereum community\nYou have experience with go-libp2p or other libp2p implementations\nYou have experience with C-Bindings & Cgo\nYou are in Web3 or blockchain development\nYou have experience working for an open source organization\nYou have experience working async\n[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].\nHiring Process\nIntro call with our People Ops team\nInterview with member of the Waku team\nPair programming session with member of the Waku team\nInterview with Program Lead\nCompensation\nThe expected compensation range for this role is $65,000 - $80,000 (negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto).\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, React, Mobile, Golang, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n⏰ Async\nLocation\nRemote (Worldwide)"
    },
    "21": {
        "company": "Parity Technologies",
        "href": "https://www.remoteok.com/remote-jobs/remote-typescript-toolkit-engineer-apps-framework-parity-technologies-198322",
        "name": "TypeScript Toolkit Engineer Apps Framework",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Design;React;Front-End;Designer;Developer;Code;Web;Node JS;Typescript;Engineer;Backend",
        "day": "22d",
        "description": "Parity Technologies builds core infrastructure for blockchains and Web 3.0 technologies. This means dealing with P2P networking, consensus algorithms, cryptography, databases, and decentralised applications. We strive to write the fastest, lightest, and safest core technology in Blockchain and write lots of open-source code.\nAt Parity Technologies, we have built and launched live networks like Kusama and Polkadot atop the Substrate blockchain framework. We want to bring to these networks first-class end-to-end user experiences which tell a story of how easy it is to use these next-generation blockchains. For example, improving how users participate in network staking, how members of our governance systems present and vote on proposals, enabling simple integration of Substrate systems into web pages, improving how new users onboard into our ecosystem, and more…\nIn this role, you’ll help bring to life an open-source TypeScript toolkit to enhance the Substrate / Web 3 developer experience. The aim of this toolkit is to reduce friction in creating efficient interactions with many chains. You will work in a small functional team with two front-end developers, one backend developer, and one designer to create core utilities, pattern libraries, and examples. This will be the basis for a new open source community, of which you’ll be a steward. We will all share the responsibility of triaging issues, engaging with developers, and assessing their needs. This role will surely evolve, and hopefully, you’ll help drive its evolution. There will be many ways to help the toolkit and its users succeed.\nAbout You:\nYou have experience building both browser and NodeJS applications with TypeScript.\nYou think deeply about paradigm-shifting tools, such as React and GraphQL.\nWell-designed APIs bring you immense joy.\nYou have excellent communication skills.\nWriting legible, maintainable code is more important to you than are your stylistic preferences.\nTo you, release announcements from the TypeScript team feel like special occasions. Maybe you even follow along with notes from the TypeScript team’s design meetings.\nYou don’t need to be a blockchain expert. Just excited and willing to learn!\nResponsibilities:\nCollaborating with the team on design, roadmap and overall strategy\nWriting both low-level and high-level code\nModeling chain interactions as type-safe, composable building blocks\nDocumenting your creations\nIdentifying bugs, bottlenecks and opportunities for improvement\nActively participating in / supporting a new community in open source\nGood to have:\nLanguage design, compiler, interpreters.\nCreating and releasing open source\nEffect-oriented programming (ZIO, effect-ts)\nKnowledge of Web Assembly\nNot a perfect match to our requirements? We're happy to receive your application anyways and hear how you think you can help us achieve our mission.\nTo see how we use your data please see our Applicant Notice.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, React, Typescript, Engineer, Backend and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nLocation\nWorldwide"
    },
    "22": {
        "company": "CoW Protocol",
        "href": "https://www.remoteok.com/remote-jobs/remote-integration-engineer-cow-protocol-199353",
        "name": "Integration Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Defi;Ethereum;React;Front End;Game;Technical;Support;Developer;Software;Growth;Code;Web;Travel;Finance;Sales;Go;Engineer",
        "day": "20d",
        "description": "About CoW Protocol \nCoW Protocol is on a mission to create the fairest and most efficient venue for exchanging digital assets on all EVM-compatible chains. Since launching a year ago, we have passed $20bn (yes, billion) in trade volume, and become the 2nd most popular DEX Aggregator on the market -- aiming for #1. If you are a high-performing team player who wants to work on some of the most important problems in Ethereum (MEV protection, consumer protection, batch auctions, and more), we want to talk to you!\nLocation: We are a fully remote team, and although we hire globally, there is a preference for this role to be based in Europe or remote +/- 3 hours CEST time\nPosition: Full-time Contractor\nAbout the role\nYou will be part of the frontend team and closely align and work together with the business development team. The goal for this role is to increase the amount of integrations of CoW Swap and grow the general ecosystem that’s built around CoW Swap. As part of your role you will examine and brainstorm new collaboration ideas with our partners, improve the SDK and general developer experience, work closely on our grants program (define bounties and evaluate submissions), and attend conferences and hackathons.\nWhat you’ll do\nBe CoW Protocol’s foremost expert on the developer audience. Work to understand the core needs, pain points, and motivations of external engineers that are tasked with evaluating and implementing CoW Protocol\nStructure documentation requirements for developers with varying objectives — from integrating CoW Protocol into their existing DeFi platforms to creating new solvers for the core protocol\nDevelop features that foster fast integrations (e.g. easy to integrate widget for swapping)\nHelp the CoW GrantsDAO in creating new technical bounties as well as assessing bounty applications and submissions\nPlan, oversee, and develop materials for CoW Protocol’s presence at hackathons. Travel the globe to be an on-hand resource for anywhere between 4-8 Ethereum conferences per year\nShape the roadmap of CowSwap by collecting and scoping out new feature requests and proposing improvements that will accelerate the onboarding of new partners\nAttend sales calls between technical teams to assess deal potential, suggest other collaborations, and ideas, and evaluate priorities.\nMaintain excellent communication with current and potential partners in terms of onboarding and ongoing support.\nWho you are\nYou have several years of experience developing professional client-side web apps\nExperience in Python, JS, React\nExperience designing restful API\nAutomation of tools, docker\nA natural collaborator and problem solver\nExperience developing software solutions\nExtrovert, you enjoy talking to other devs and exploring new ideas for collaborations\nExcellent communication skills in English\nExcited by new challenges\nProactive & hands-on! Sending code snippets to kick-start an integration can go a long way!\nIt’s a plus if you bring:\nUnderstanding of the Ethereum blockchain and ecosystem, general finance and/or game theory, and mechanism design.\nGood to have other relevant languages, like Rust, C++, Solidity\nGood to have experience in consulting, on technology solutions or as a client-facing solutions architect, integrations engineer, or similar\nOur tech stack\nProduct: Typescript, React, Redux, styled-components, Rust, Python, C++\nWeb3 development: Web3, ethersjs, Hardhat, Foundry, Solidity, IPFS, TheGraph, ENS\nTesting: jest, cypress, React testing-library\nAnalytic tools: Dune Analytics, Google Analytics\nWhat we can offer you\nFlexible work environment: join one of our hubs in Berlin or Lisbon or work remotely with the option of joining a local coworking space;\nCompetitive compensation and a stake in the success of the project (token plan);\nRegular trips to reunite with the rest of the team;\nConference budget to keep up to date with the developments of the ecosystem;\nLearning budget to support your higher ambitions;\nImpact: If you are joining a startup, and you can make a huge difference. Your work matters!\nBut most importantly - grow with us! We're growing rapidly, the industry is expanding fast, and we have a lot to do. If you're someone who loves taking the initiative and getting things done, there are a lot of opportunities for you at CoW Protocol. We’re enthusiastic about our shared mission and enjoy spending time together!\nCulture\nLife in CoW Protocol is an amazing journey, we pride ourselves on how we work together. We like autonomy, we think big, and we have a growth mindset. We value initiatives and ownership. Our work is open source, designed code is publicly accessible - anyone can see, modify, and distribute the code as they see fit.\nResearch shows that while men apply to jobs when they meet an average of 60% of the criteria, women and other folks tend to only apply when they check every box. If you think you have what it takes but don't necessarily meet every single point on the job description, please still get in touch. We would love to hear from you.\nWe look forward to your application!\n \nAt CoW Protocol, we strive to create an inclusive environment that empowers our employees. We believe that our products and services benefit from our diverse backgrounds and experiences and are proud to be an equal opportunity employer: all qualified applicants are considered for positions regardless of race, ethnic origin, age, religion or belief, marital status, gender identification, sexual orientation, or physical ability.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Defi, React, Travel, Finance, Sales, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n📚 Learning budget\nLocation\nWorldwide"
    },
    "23": {
        "company": "Status SNT",
        "href": "https://www.remoteok.com/remote-jobs/remote-web-developer-status-snt-199365",
        "name": "Web Developer",
        "location": "Remote (Worldwide)",
        "pay": "💰 $70k - $120k*",
        "tags": "Developer;Web;Design;React;React JS;Embedded;Front End;Docker;Technical;Software;Testing;Code;Node JS;Lead;Branding",
        "day": "20d",
        "description": "Status is an organization building the tools and infrastructure for the advancement of a secure, private, and open web3. We have been completely distributed since inception. Our team is currently 120+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe. We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.\nOur organization is closely involved in a new community lead project, called Logos, and this role will enable you to focus on its development. Logos is a grassroots movement to provide trust-minimized, corruption resistant governing services and social institutions to underserved citizens. Logos’ infrastructure will provide a base for the provisioning of the next-generation of governing services and social institutions - paving the way to economic opportunities to those who need them most, whilst respecting basic human rights through the network’s design.\nIn order to promote the ideas behind Logos and its vision, we have created a brand studio called acid.info and you will be part of it. Acid.info is the studio and creative engine within the Logos DAO. Our mission is to build, and ensure, technologies and creativity that supports freedom, justice, and innovation for all people of the world.\nThe role\nThere are multiple departments embedded within our studio; Future Lab for experimentations, Press engine for copywriting, editing and content, Hype Machine for marketing and PR and The factory for production. Your primary role will be mainly within The Factory and so helping with the production line for studio’s projects including the ones from other departments. As secondary role you are always welcome to contribute and engage with other departments incase you are interested.\nAs a Web Developer you are responsible for development and technical maintenance of various web-based projects in the studio. This includes development, deciding the overall architecture of the code-base, code reviews, writing tests, choosing the right tech-stack, deployment, and any other related tasks. You will be working closely with our PM/Creative Technologist and UI/UX Designer.\nWho you are\nYou have circa 2 to 4 years of experience in Web Development\nYou are passionate about web development and you keep up to date on the daily-born web technologies\nYou care about open-source software and you can manage and maintain such projects\nYou are flexible to work with creative minds and welcome experimentations\nKey responsibilities\nYou will take care of all technical aspects of all web projects, from development and testing to deployment and maintenance:\nYou will be improving the architecture and implementation of our current site-generator framework (built on top NextJS) and develop it further\nYou will be developing and implementing internal tools, including our branding design portal and assets generator framework and a React library for our design systems\nYou will co-write documentation for all the above mentioned products/projects\nYou will be responsible for maintaining our open-sourced codebases on Github\nYou ideally will have\n2 to 4 years of experience in ReactJS and NodeJs (all in Typescript)\nGood understanding of software architecture\nExperience in implementation of frontend libraries and design systems\nExperience working with Git, Docker and NextJS framework as well as Vercel and/or Netlify\nA strong alignment to our principles: https://status.im/about/#our-principles\nBonus points if\nYou are comfortable in working remotely and asynchronously\nYou have experience working for an open source organization\nYou have exposure to creative coding (processing, open frameworks, WebGL, writing shaders, p5js)\nCompensation\nWe are happy to pay in either 100% fiat or any mix of fiat and/or crypto. For more information regarding benefits at Status: https://people-ops.status.im/tag/perks/\nHiring process\nInterview with People Ops\nTechnical interview\nAssessment (paid)\n[The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, React, Embedded, Docker, Testing and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n⏰ Async\nLocation\nRemote (Worldwide)"
    },
    "24": {
        "company": "Magna",
        "href": "https://www.remoteok.com/remote-jobs/remote-tech-lead-magna-199865",
        "name": "Tech Lead",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Design;Crypto;React;Security;Technical;Software;Code;Management;Lead;Senior;Analytics;Legal;Healthcare;Engineer;Engineering",
        "day": "19d",
        "description": "About Magna\nMagna’s goal is to be the one-stop solution for all token-based crypto companies who want to track outstanding and promised token allocations, automate the distribution of those tokens, and manage information about their stakeholders. Some liken us to “Carta for Web3”.\nOur mission is to make it easier for crypto companies to manage their tokens and tokenholders so that they can focus on their product and not custom internal tools and smart contracts as they scale. We work with projects of all sizes throughout various L1 & L2 ecosystems.\nTokens are amongst the core assets crypto companies use to compensate and incentivize investors, employees, advisors, and even community members. The most common use cases for Magna include:\nToken Vesting to employees and investors - Automated token distribution based on custom unlock schedules.\nToken Streaming - Continuous distribution of tokens to stakeholders.\nAirdrops - Vested airdrops to community members.\nProgrammable Unlocks – Distributing tokens using our SDK based on contract interactions or in-app/in-game accomplishments.\nStakeholder Management – Tracking tax liability and legal filings for tokenholders and more.\nMagna’s platform is used by investors, employees, accountants, lawyers, and other key stakeholders throughout the crypto ecosystem.\nWhy Work at Magna?\nWe’re a highly technical team\nThis is a space with deep technical challenges that reward builders. The blockchain isn’t just a distributed ledger anymore, it’s a distributed state machine. At Magna, we’re not just building a new paradigm of software — we’re also trying to leverage the best of web2 while we’re at it.\nWe’re a well-funded company with runway that can last us through the bear market (as long as that may be)\nA downtown Manhattan office with our own rooftop – we operate on a hybrid model, where most employees come in a couple of times per week.\nHardware — Whatever you need to get things done, plus a stipend to set up your home office.\nLearning budget — Buy courses and attend conferences or hackathons.\nUnlimited Vacation — Take time off when you need it - 2 week minimum.\nTop-notch healthcare plans — We offer the best available platinum PPO and other similar plans that give you the most options with the lowest deductibles.\nAbout the Role\nThe ideal tech lead is a senior software engineer who oversees the development of projects and mentors a team of engineers. By joining Magna, you will build the future of token management with us by making crucial decisions in the design and implementation of software architecture that scales.\nWhat you’ll do\nOwn the software architecture and technical designs, providing technical leadership and expertise along the way\nIdentify and mitigate technical risks\nEnsure that technical debt is kept under control\nWhere appropriate, ensure code modularity in the code written by the team through peer code-reviews, to increase our team’s velocity and make our code infrastructure more scalable\nWork closely with the product owner to ensure that the roadmap is feasible and deadlines are realistic\nReview potential engineering candidates as we grow our footprint and scope\nWhat we’re looking for\nA team leader, or a senior software engineer ready to step up! Someone with directionally 5+ years of experience.\nExperience working with data-intensive applications, or apps used by tens of thousands of users\nFamiliarity with our tech stack\nBased in New York City and open to a hybrid work environment\nMagna’s Tech Stack\nMagna is a multi-chain dapp, and our stack includes TypeScript, Next.js, React and GraphQL, as well as the native languages for various blockchains (i.e. Solidity, Rust, Move).\nExperience with any of these is nice to have, but not a requirement:\nDevOps, infrastructure, or data analytics experience\nInterfacing with smart contracts and blockchain via libraries (any blockchain).\nApplications where security and integrity is extremely important (finance, fintech, government, etc.)\nReasons you might be the right candidate for this role\nExperience leading a team — You’re used to splitting up work, reviewing PRs, and holding the team to a high bar of technical excellence and thoughtful\nPassion for engineering — genuine passion and curiosity for the craft that you bring to work each day\nGood taste — You think critically about how you build what you build, and apply good judgment to every design and implementation decision along the way.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Crypto, React, Senior, Legal, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n🏖 Unlimited vacation\n📚 Learning budget\nLocation\nWorldwide"
    },
    "25": {
        "company": "Magna",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-software-engineer-magna-199874",
        "name": "Senior Software Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Design;Crypto;React;Security;Technical;Code;Senior;Operations;Analytics;Legal;Healthcare;Engineer",
        "day": "19d",
        "description": "About Magna\nMagna’s goal is to be the one-stop solution for all token-based crypto companies who want to track outstanding and promised token allocations, automate the distribution of those tokens, and manage information about their stakeholders. Some liken us to “Carta for Web3”.\nOur mission is to make it easier for crypto companies to manage their tokens and tokenholders so that they can focus on their product and not custom internal tools and smart contracts as they scale. We work with projects of all sizes throughout various L1 & L2 ecosystems.\nTokens are amongst the core assets crypto companies use to compensate and incentivize investors, employees, advisors, and even community members. The most common use cases for Magna include:\nToken Vesting to employees and investors - Automated token distribution based on custom unlock schedules.\nToken Streaming - Continuous distribution of tokens to stakeholders.\nAirdrops - Vested airdrops to community members.\nProgrammable Unlocks – Distributing tokens using our SDK based on contract interactions or in-app/in-game accomplishments.\nStakeholder Management – Tracking tax liability and legal filings for tokenholders and more.\nMagna’s platform is used by investors, employees, accountants, lawyers, and other key stakeholders throughout the crypto ecosystem.\nWhy Work at Magna?\nWe’re a highly technical team\nThis is a space with deep technical challenges that reward builders. The blockchain isn’t just a distributed ledger anymore, it’s a distributed state machine. At Magna, we’re not just building a new paradigm of software — we’re also trying to leverage the best of web2 while we’re at it.\nWe’re a well-funded company with runway that can last us through the bear market (as long as that may be)\nA downtown Manhattan office with our own rooftop – we operate on a hybrid model, where most employees come in a couple of times per week.\nHardware — Whatever you need to get things done, plus a stipend to set up your home office.\nLearning budget — Buy courses and attend conferences or hackathons.\nUnlimited Vacation — Take time off when you need it - 2 week minimum.\nTop-notch healthcare plans — We offer the best available platinum PPO and other similar plans that give you the most options with the lowest deductibles.\nAbout the Role\nBuild the future of token operations with us by designing and implementing software architecture that scales. We’re looking for someone comfortable going from zero-to-one and rapidly iterating on hackathon-style projects with other engineers as we grow.\nWhat you’ll do\nWork on the forefront of token distribution technology at the infrastructure level, solving edge-cases around token distribution, writing smart contracts for tokens worth millions of dollars\nBuild polished user experiences and applications\nWhere appropriate, ensure code modularity in the code written by the team through peer code-reviews, to increase our team’s velocity and make our code infrastructure more scalable\nWrite tests to make sure that things work when we ship them. If our users can’t use the app, they can’t get paid!\nWhat we’re looking for\nExperience working with data-intensive applications, or apps used by tens of thousands of users\nComfortable working in sprint cycles and willing to bite the bullet when critical issues pop up\nFamiliarity with our tech stack\nBased in New York City and open to a hybrid work environment\nMagna’s Tech Stack\nMagna is a multi-chain dapp, and our stack includes TypeScript, Next.js, React and GraphQL, as well as the native languages for various blockchains (i.e. Solidity, Rust, Move).\nExperience with any of these is nice to have, but not a requirement:\nDevOps, infrastructure, or data analytics experience\nInterfacing with smart contracts and blockchain via libraries (any blockchain).\nApplications where security and integrity is extremely important (finance, fintech, government, etc.)\nReasons you might be the right candidate for this role:\nPassion for engineering — genuine passion and curiosity for the craft that you bring to work each day\nGood taste — You think critically about how you build what you build, and apply good judgment to every design and implementation decision along the way.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Crypto, React, Senior, Legal, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n🏖 Unlimited vacation\n📚 Learning budget\nLocation\nWorldwide"
    },
    "26": {
        "company": "Magna",
        "href": "https://www.remoteok.com/remote-jobs/remote-web3-full-stack-engineer-magna-199877",
        "name": "Web3 Full stack Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Web3;Design;Crypto;Ethereum;React;Security;Technical;Developer;Software;Code;Operations;Analytics;Legal;Healthcare;Engineer",
        "day": "19d",
        "description": "About Magna\nMagna’s goal is to be the one-stop solution for all token-based crypto companies who want to track outstanding and promised token allocations, automate the distribution of those tokens, and manage information about their stakeholders. Some liken us to “Carta for Web3”.\nOur mission is to make it easier for crypto companies to manage their tokens and tokenholders so that they can focus on their product and not custom internal tools and smart contracts as they scale. We work with projects of all sizes throughout various L1 & L2 ecosystems.\nTokens are amongst the core assets crypto companies use to compensate and incentivize investors, employees, advisors, and even community members. The most common use cases for Magna include:\nToken Vesting to employees and investors - Automated token distribution based on custom unlock schedules.\nToken Streaming - Continuous distribution of tokens to stakeholders.\nAirdrops - Vested airdrops to community members.\nProgrammable Unlocks – Distributing tokens using our SDK based on contract interactions or in-app/in-game accomplishments.\nStakeholder Management – Tracking tax liability and legal filings for tokenholders and more.\nMagna’s platform is used by investors, employees, accountants, lawyers, and other key stakeholders throughout the crypto ecosystem.\nWhy work at Magna?\nWe’re a highly technical team\nWe love the openness and transparency of web3, but we’re working in the space because of the deep technical challenges that reward builders.\nThe blockchain isn’t just a distributed ledger anymore, it’s a distributed state machine. At Magna, we’re not just building a new paradigm of software — we’re also trying to leverage the best of web2 while we’re at it. It’s amazing fun if you’re a developer who’s new to web3 and able to appreciate a lot of beautiful technical-first design decisions for the first time. (Have you ever tried to match a CUSIP number before?? It’s painful.)\nWe’re a well-funded company with runway that can last us through the bear market\nA downtown NYC office with our own rooftop – We have a 3,300 sqft office in Soho, with a private roof. We operate on a hybrid model, where most employees come in a couple of times per week.\nHardware — Whatever you need to get things done, plus a stipend to set up your home office.\nLearning budget — Buy courses and attend conferences or hackathons.\nMonthly Wellness Stipend — Take care of yourself, whatever that means for you!\nUnlimited Vacation — Take time off when you need it - 2 week minimum.\nTop-notch healthcare plans — We offer the best available platinum PPO and other similar plans that give you the most options with the lowest deductibles.\nAbility to take ownership and build out functions within your department\nAbout the Role\nBuild the future of token operations with us by designing and implementing software architecture that scales. We’re looking for someone comfortable going from zero-to-one and rapidly iterating on projects while making carefully calculated decisions.\nWhat you’ll do\nWork on the forefront of token distribution technology at the infrastructure level and solve edge-cases around token distribution\nBuild polished dApps responsible for tokens worth millions of dollars\nWhere appropriate, ensure code modularity in the code written by the team through peer code-reviews, to increase our team’s velocity and make our code infrastructure more scalable\nWrite tests to make sure that things work when we ship them. If our users can’t use the app, they can’t get paid!\nWhat we’re looking for\nProfessional experience working on dApps and integrating pre-written smart contracts into dApps - please note that this is a hard requirement\nKnowledge of how smart contracts work, Ethereum signatures, wallet connections, and transaction signing/execution\nStrong experience with web3 libraries such as web3.js, ethers.js, wagmi.\nExperience working with data-intensive applications, or apps used by tens of thousands of users\nComfortable working in sprint cycles and willing to bite the bullet when critical issues pop up\nFamiliarity with our tech stack\nMagna’s Tech Stack\nMagna is a multi-chain dApp, and our stack includes TypeScript, Next.js, React and GraphQL, as well as the native languages for various blockchains (i.e. Solidity, Rust, Move).\nExperience with any of these is nice to have, but not a requirement:\nDevOps, infrastructure, or data analytics experience\nApplications where security and integrity is extremely important (finance, fintech, government, etc.)\n﻿Reasons you might be the right candidate for this role:\nCuriosity — keeping up with advancements and best practices in web3 can be tiring, but you try anyways!\nPassion for engineering — genuine passion and curiosity for the craft that you bring to work each day\nGood taste — you think critically about how you build what you build, and apply good judgment to every design and implementation decision along the way.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, Design, Crypto, React, Legal, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n🏖 Unlimited vacation\n📚 Learning budget\nLocation\nWorldwide"
    },
    "27": {
        "company": "Status SNT",
        "href": "https://www.remoteok.com/remote-jobs/remote-software-engineer-status-snt-199869",
        "name": "Software Engineer",
        "location": "Remote (Worldwide)",
        "pay": "💰 $70k - $120k*",
        "tags": "Software;Web3;NFT;Ethereum;React;Support;Developer;Mobile;Golang;Engineer",
        "day": "19d",
        "description": "About Status\nStatus is building the tools and infrastructure for the advancement of a secure, private, and open web3. \nWith the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.\nAs an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community. \nAs a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol (a continuation of Whisper).\nAs a team, Status has been completely distributed since inception. Our team is currently 150+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe. \nWe care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.\nAbout Waku\nWe are building Waku as a public good infrastructure. Waku is the messaging layer of Web3.\nIt is a decentralized, censorship-resistant, privacy-preserving communication network that enables anyone to send and receive messages without worrying about surveillance or deplatforming.\nWe are developing 3 open source implementations of Waku:\nNwaku. https://github.com/waku-org/nwaku: the reference implementation and service node\nJs-waku, https://github.com/waku-org/js-waku: for the browser\nGo-waku: https://github.com/waku-org/go-waku: to integrate as a library in native applications\nWe are enabling Ethereum builders to create new projects with a fully decentralized architecture, think dApp to Wallet notifications, NFT marketplaces, censorship-resistant chat, layer-2 decentralization and more.\nWe are looking for a Software Engineer who is passionate about Ethereum, and decentralization. And who would relish the opportunity to champion Waku to other Web3 projects and developers.\nKey Responsibilities\nDesign, implement and document Waku Golang libraries (go-waku)\nMaintain, improve, troubleshoot Waku React Native, the React Native wrapper of go-waku\nImplement new protocols as defined by the Research Team\nInvestigate and fix issues in go-waku and upstream libraries such as go-libp2p\nOptimize go-waku and upstream libraries for the mobile/React Native\nSupport dApp developers in using go-waku and Waku Golang libraries\nYou ideally will have\nExperience building applications with complex logic, cutting edge technology or applied research\nAbility to learn new concepts and technologies quickly, you are a polyglot\nExperience maintaining native library for React Native\nExperience building libraries in Golang, for network and mobile environments\nGood communication skills (written and conversational)\nStrong alignment to our principles: https://status.im/about/#our-principles\nBonus points if\nYou are already familiar with the Ethereum community\nYou have experience with go-libp2p or other libp2p implementations\nYou have experience with C-Bindings & Cgo\nYou are in Web3 or blockchain development\nYou have experience working for an open source organization\nYou have experience working async\n[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].\nHiring Process\nIntro call with our People Ops team\nInterview with member of the Waku team\nPair programming session with member of the Waku team\nInterview with Program Lead\nCompensation\nThe expected compensation range for this role is $65,000 - $80,000 (negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto).\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, React, Mobile, Golang, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n⏰ Async\nLocation\nRemote (Worldwide)"
    },
    "28": {
        "company": "Venturerock",
        "href": "https://www.remoteok.com/remote-jobs/remote-lead-developer-venturerock-200379",
        "name": "Lead Developer",
        "location": "Remote job",
        "pay": "💰 $70k - $120k*",
        "tags": "Developer;Design;React;Front-End;Full-Stack;Founder;Technical;Support;Growth;Code;JavaScript;Investment;Cloud;Git;API;Lead;E-Commerce",
        "day": "18d",
        "description": "About Venturerock\nVenturerock is an early-stage digital venture capital platform and ecosystem of founders, backers & builders.\nTogether, we have transformed the venture capital model into a venture building model, to build & grow tech companies into global tech leaders. We have combined technology and our experience in accelerating 700+ startups to design our own investment protocol. Our founder team has been part of companies like Just-Eat, iChoosr, Exact, Relayr to mention a few. We invest in multiple rounds from pre-seed to scale, through a metered and auditable process.\nResponsibilities for this Lead developer role for \"Drop-ET\":\nYou will use our blueprint to build, measure, learn and pivot your way to a profitable and thriving company. This does not mean everything is set in stone because our founders will need to put their own stamp on everything they're doing. Later, you'll assemble a dedicated team and define a unique company culture.\nSome technical founder activities include:\nDesign and build the technical blueprint of the company;\nBuilding the (cloud) infrastructure;\nProduct development;\nManaging every technical detail;\nBuild and hire a development team;\nScaling the operation.\nOf course, there is more to do, but you don’t have to do it all by yourself. You'll be accompanied by a co-founder to take on this great challenge. Also, our FoundersLAB is available to support you during the first rough months.\nProblem Statement:\nDrop-ET is a Smart Logistics Platform for the APAC countries. Due to enormous growth in e-commerce A-Brands have been hijacking all delivery capacity in India. Delivery companies are overbooked, and the rest of the non-A brand e-commerce companies don’t have access to reliable delivery.\nWith Drop-ET we help delivery companies and medium-sized e-commerce companies get in control again. We are developing a fully equipped delivery EV, attainable for everyone. No CAPEX, everyone can immediately start as a delivery agent and they only pay-per-use. This delivery EV is connected to our platform, this means better routes, extra orders and collecting POI data during your Drop-ET rides. This amazing adventure still has some essential seats left. Do you want to hop on board of our EV and join our journey to a smarter Indian transport\necosystem?\nYou have 5+ experience as a full-stack developer (i.e. front-end and back-end);\nStrong experience with modern JavaScript (ES2017), Node.js, HTML,\nCSS/SCSS, REACT as a framework and composition.\nExperience with Restful API design, containerization (mostly docker), microservices, event-driven architecture, cloud architecture and understanding of data structures and algorithms.\nWorking in a fast-paced Continuous Integration & Deployment environment gets you excited.\nEnforce code quality through Test-Driven Development and linting.\nYou know how Git works.\nYou’re proud of your work and welcome all feedback.\nYou are experienced in developing, testing, shipping and maintaining products under pressure;\nYou’re self-learning, independent, and have excellent problem-solving skills.\nWorking with Scrum/Agile working is second nature to you.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, React, JavaScript, Cloud, Git, API and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nLocation\nRemote job"
    },
    "29": {
        "company": "Premia Jobs",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-frontend-web3-engineer-premia-jobs-200892",
        "name": "Senior Frontend & Web3 Engineer",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Web3;Front End;Defi;Crypto;React;System;Front-End;Cto;Technical;Software;Code;Web;Financial;Senior;Marketing;Analytics;Engineer;Engineering",
        "day": "17d",
        "description": "Senior Frontend & Web3 Engineer - Remote\nPremia is a decentralized options platform connecting traders and liquidity providers of all backgrounds. Offering non-custodial options to hedge, speculate, or earn yield on your digital assets. Premia offers first of its kind automated market maker solutions in the DeFi space for Options Contracts through our use of Smart Liquidity Pools and Dynamic Pricing. Premia enables best-in-class pricing based on market volatility, providing fully-featured peer-to-pool trading and capital efficiency to DeFi options. We are one of the smallest and most impactful teams in crypto. We are a globally distributed organization, with all positions being fully remote. We’re looking for a passionate, self-motivated engineer to help us build the next generation of financial products. As a dedicated frontend hire, you will gain ownership over our existing suite of web products, as well as the ability to influence the creation, design, and execution of future products. You will be responsible for ensuring a consistent, high-quality user experience across trading interfaces, data-heavy analytics pages, documentation portals and more. Who are you?A senior-level front-end engineer (JS/TS + React veteran) who is also crypto-native. At the very least, you understand and hold crypto assets or ideally have developed decentralized applications leveraging blockchain technology before, preferably EVM-compatible. \nYou are passionate about building bleeding-edge technology for the next iteration of the internet with the use of cryptography and understand the necessity for building beautiful and user-friendly GUIs in order to facilitate the transition to web3. \nYou have experience and are culturally aligned with fast-moving small teams. You have worked at remote (globally distributed) startups before. You are self-driven, are comfortable wearing many hats, can ship patches and features swiftly when needed. You can identify company priorities, own them, and iterate quickly to ship the best solution.\nYou can write and speak fluent English and have great communication skills.\nThe Role:Engineers at Premia work with our CTO and our existing engineering team to innovate, architect, and develop user-facing features and new iterations of the Premia app, as well as our event indexing system (The Graph).\nIn addition, you will work closely with other departments such as Design, QA, Operations, and Marketing teams to successfully execute the implementation, testing, and deployment of new features.\nAs a senior engineer, you will help (mentor) other members of the team, and will make sure components and app pages are well optimized and running smoothly. \nResponsibilities-Design, scope, and estimate complex features at the component level.-Build, test, and ship features, patches, and updates to our web app.-Collaborate with the team and cross-functional partners on all aspects of product development.-Identify and advocate for team-wide areas of improvement and best practices.-Mentor team members to refine their technical and architectural skills.-Help maintain our subgraph repository written in AssemblyScript (JS subset)\nRequirements-Experience owning and shipping products-5+ years of industry experience in software engineering\n-A mastery of Javascript, Typescript, and React with an understanding of encryption and cryptography fundamentals.\n-Experience working with GraphQL-Basic web3 understanding: Wallets, transactions, explorers, POW/POS, gas price, etc.-Ability to quickly iterate and ship code using test-driven development patterns-Ability to build modern, event-driven React frontends, converting Figma designs into functional components-Mastery of CSS, preferably via a library like MaterialUI-Experience with version control, such as Git-Knowledge of engineering best practices such as continuous integration-Exceptional judgment, problem-solving skills, and an analytical mindset-Ability to work in areas beyond your comfort zone and motivated by personal growth-A passion for learning and a self-awareness of your learning style-(Nice to have) Previous experience with web3.js or ethers.js libraries. \nBenefitsWork from anywhere (Remote first), Flexible working hours, Flexible vacation policy, Competitive Salary + Token bonus (portion or all can be paid in Crypto). Premia is committed to a diverse and inclusive workplace and is an equal opportunity employer. We do not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.\nPremia welcomes all qualified persons to apply. Compensation will be competitive and commensurate with experience. This is a full time role.\nTo find out more you can view their website at https://premia.finance/\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Web3, Defi, Crypto, React, Senior, Marketing and Engineer jobs that are similar:\n$70,000 — $120,000/year\nLocation\nWorldwide"
    },
    "30": {
        "company": "OP Labs",
        "href": "https://www.remoteok.com/remote-jobs/remote-senior-frontend-engineer-ecosystem-op-labs-200893",
        "name": "Senior Frontend Engineer Ecosystem",
        "location": "Worldwide",
        "pay": "💰 $70k - $120k*",
        "tags": "Front End;Design;Crypto;Ethereum;React;Front-End;Security;Technical;Support;Software;Growth;UI;Code;Web;JavaScript;Typescript;Senior;Analytics;Recruiting;Engineer",
        "day": "17d",
        "description": "From the code to the values, we are Ethereum-aligned. We believe Ethereum has the potential to solve some of humanity’s most crucial coordination issues. Since our initial inception as a non-profit research group, we have have sought to scale both its technology and values.\nAt present the most pressing bottleneck to the growth of Ethereum is its performance and scalability. We are building the most elegant solution to this problem. We do this out in the open because we believe in open source and its ability to accelerate innovation.\nNot only do we improve Ethereum's performance by orders of magnitude, we donate 100% of the profits generated from doing so to Ethereum public goods. We do this because we believe the future of the open internet is too important to be left to chance. By operating as a Public Benefit Corporation we're able to align private incentives with public good and create a positive-sum economic model that provides a sustainable future for the internet.\nWe are hiring a Frontend Engineer to join our Ecosystem pod in building products that drive growth to Optimism. The person in this role will work closely with product, design and analytics teams and have a meaningful impact on the Optimism user experience.\nWhat are the role responsibilities?\nShape and build products that drive growth of the protocol\nContribute to iterations on Optimism’s governance and identity work\nWork with launch partners from across the Ethereum ecosystem\nCollect and provide feedback on the Optimism builder experience\nWork with design team to fine-tune the Optimism design system\nCreate smooth and elegant user experience with modern-day Javascript based UI frameworks like React\nWhat skills do you bring?\nA strong background in product-centric software development\nA strong background in product-centric software development\nExperience working on a highly cross-functional team\nFluency in React and Typescript with knowledge of current best practices and understanding of the trends and technical progression of web frameworks and design patterns\nFamiliarity with front-end architecture, including performance, security and usability\nExperience implementing web experiences for desktop and responsive experiences for mobile\nKnowledge of blockchain fundamentals and the crypto landscape a strong plus\nRecent Eosystem Pod projects:\nQuests (onboarding)\nThe AttestationStation (identity layer)\nThe Optimist NFT (identity layer)\nWhat you'll like about us:\nWe take care of our employees—from fully paid medical, dental and vision to a 4% 401K match, we've got you covered—learn more about our benefits, culture and all recruiting FAQ here.\nWe take pride in the accomplishments of our teammates and support each other in doing the best work of our careers.\nOur team is a diverse group of people from a variety of backgrounds and interests. We cherish our eclecticism and consider it a great strength.\nWe have a transparent, feedback-driven and fun-centric culture.\nWe are a team of builders—our founding team has been working on Ethereum scalability since 2015.\nWe strongly encourage candidates of all different backgrounds to apply. We believe that our work is stronger with a variety of perspectives, and we’re eager to further diversify our company. If you have a background that you feel would make an impact at Optimism, please consider applying. We’re committed to building an inclusive, supportive place for you to do the best work of your career.\nSalary and compensation\nNo salary data published by company so we estimated salary based on similar jobs related to Design, Crypto, React, JavaScript, Typescript, Senior, Engineer and Digital Nomad jobs that are similar:\n$70,000 — $120,000/year\nBenefits\n💰 401(k)\nLocation\nWorldwide"
    }
}